content/posts/20210606201045-roamkasten_a_practical_how_to_guide_to_optimize_zettelkasten_in_roam_research.md
+++
title = "Roamkasten - a practical how to guide to optimize Zettelkasten in Roam Research"
author = ["Daniel Biasiotto"]
tags = ["article"]
draft = false
+++

-   Source: <https://www.thrivinghenry.com/writings/roamkasten-a-practical-how-to-guide-to-optimize-zettelkasten-in-roam-research>
-   Author: [Thriving Henry]({{< relref "20210606201141-thriving_henry.md" >}})
-   Tags: [Zettelkasten]({{< relref "20200528213816-zettelkasten.md" >}}), [roam]({{< relref "20210606201438-roam.md" >}}), [Note Taking]({{< relref "20200528214634-note_taking.md" >}}), [PKM]({{< relref "20210606203437-pkm.md" >}})


## Outline {#outline}

-   read a lot -&gt; forget a lot
-   Roam + Zettelkasten = Roamkasten
-   reading a lot but not digesting the content: [cognitive constipation]({{< relref "20210606214324-cognitive_constipation.md" >}})
-   concepts
    -   bi-directional linking
        -   same concept as a wiki, with the difference that once the link is created it links both ways
    -   searching unlinked references
        -   org-roam: `org-roam-unlinked-references`
    -   tree structure with bullet points, parent-children relationship
    -   inline seamless page creation, feels very easy and inexpensive
    -   graph structure much like our brain
    -   the more you use a link between concepts the more it strengthen
-   [Conor White-Sullivan]({{< relref "20210606203601-conor_white_sullivan.md" >}}): `Roam was built with a low floor and high ceiling`
-   flow of the Zettelkasten: fleeting notes -&gt; literature notes -&gt; permanent notes -&gt; related notes
    -   f.n.: highlighting, writing in the margin of the text, annotating ideas, sensations and links that come to mind while reading
    -   l.n.: atomic concepts (one idea per literature note) paraphrased and with a direct reference back to the original text
        -   not to add your own ideas here, just use your own words
        -   they must be done with diligent, active reading to attenuate your own worldview bias
            -   read and reread to distillate ideas
    -   p.n.: or Zettels; declarative statements that make an assertion related to, but not bound by, the literature and fleeting notes

> a three-legged stool - the original text, fleeting notes, and literature notes are the three legs of the stool and the zettel is what you can stand on to see further in your intellectual landscape.

-   possibility of Zettels built like [Toulmin Argument]({{< relref "20210606205926-toulmin_argument.md" >}})
    -   permanent notes are meaning less if isolated
        -   they must be thought in relation with every other Zettel in the system
            -   interconnected web
    -   conflicting ideas resurface and that is an opportunity to fix a bug in your worldview
    -   Q for the Zettel:
        -   Why did I notate it?
        -   Where does it fit in my worldview?
        -   What does it support or contradict?
        -   What ideas does it flesh out?
            -   Or is it a new idea?
    -   parent block
        -   related topics
        -   literature notes supporting
        -   fleeting notes supporting
-   the process is content agnostic
    -   just pick what interests you: patterns will emerge

-   [Roam Research]({{< relref "20210606201438-roam.md" >}}) is a supercharged [Niklas Lumann]({{< relref "20210606204109-niklas_lumann.md" >}})'s [Zettelkasten]({{< relref "20200528213816-zettelkasten.md" >}}), having a the power of a computer to track and backlink all the notes very fast and efficiently
    -   Luhmann: 2D data structure, cards stacked in a cabinet
    -   Roam: 3D data structure, with branches and backlinking in the Graph
